app/Helpers/log_helper.php

    function registrar_log(int $id_usuario, string $action)
    {
        // Pega a instância do banco de dados
        // \Config\Database é uma classe do CodeIgniter que gerencia conexões
        // connect() retorna uma conexão ativa com o banco
        // O '\' no início significa que é do namespace raiz
        $db = \Config\Database::connect();

        // Prepara os dados para inserir na tabela 'logs'
        $data = [
            'id_usuario' => $id_usuario,           // Quem fez a ação
            'action'     => $action,               // O que foi feito
            'created_at' => date('Y-m-d H:i:s'),   // Quando foi feito (data/hora atual)
        ];

        // Insere os dados na tabela 'logs'
        // table('logs') = Seleciona a tabela 'logs'
        // insert($data) = Faz INSERT INTO logs (id_usuario, action, created_at) VALUES (...)
        //
        // Query Builder = Interface do CodeIgniter para construir queries SQL
        // É mais seguro que escrever SQL manualmente (protege contra SQL Injection)
        $db->table('logs')->insert($data);
---
INSERT INTO `logs` (`id_usuario`, `action`, `created_at`) VALUES (2, 'Foto de capa atualizada para o imóvel: Sala Comercial Bem Localizada - Foto ID: 31', '2025-11-16 22:33:10')