app/Helpers/log_helper.php

INSERT INTO `logs` (`id_usuario`, `action`, `created_at`) VALUES (2, 'Foto excluída do imóvel: Sala Comercial Bem Localizada - Arquivo: foto-7-2.jpg', '2025-11-12 02:21:44')
---
    function registrar_log(int $id_usuario, string $action)
    {
        // Pega a instância do banco de dados
        $db = \Config\Database::connect();

        $data = [
            'id_usuario' => $id_usuario,
            'action'     => $action,
            'created_at' => date('Y-m-d H:i:s'), // Data e hora atual
        ];

        // Insere os dados na tabela 'logs'
        $db->table('logs')->insert($data);