app/Controllers/AuthController.php

    public function processarLogin()
    {
        $emailFormulario = $this->request->getPost('email');
        $senhaFormulario = $this->request->getPost('senha');

        // buscar o usuário pelo email
        $usuario = $this->usuarioModel->where('email', $emailFormulario)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'edersontop@gmail.com'
 LIMIT 1