app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'admin@sistema.com'
 LIMIT 1
---
    public function processarLogin()
    {
        // Pega os dados do formulário enviado via POST
        // getPost('campo') retorna o valor do campo do formulário
        $emailFormulario = $this->request->getPost('email');
        $senhaFormulario = $this->request->getPost('senha');

        // Busca o usuário no banco de dados pelo email
        // where('email', $emailFormulario) = WHERE email = 'valor'
        // first() = Retorna o primeiro resultado ou null se não encontrar
        $usuario = $this->usuarioModel->where('email', $emailFormulario)->first();