app/Controllers/BairroController.php

SELECT *
FROM `bairros`
---
    public function index(): string|ResponseInterface
    {
        // A verificação de Admin é feita pelo Filtro de Rota
        $dados['bairros'] = $this->bairroModel->findAll();

SELECT *
FROM `bairros`
WHERE `bairros`.`id` = '2'
---
    public function edit($id = null): string|ResponseInterface
    {
        $bairro = $this->bairroModel->find($id);