app/Controllers/Home.php

SELECT *
FROM `bairros`
WHERE `bairros`.`id` = '1'
---
    public function index(): string
    {
        // Busca todos os imóveis disponíveis
        $imoveis = $this->imovelModel
            ->where('status', 'disponivel')
            ->orderBy('destaque', 'DESC')
            ->orderBy('created_at', 'DESC')
            ->findAll();

        // Enriquece os dados com informações relacionadas
        foreach ($imoveis as &$imovel) {
            // Busca tipo de imóvel
            if (!empty($imovel['tipo_imovel_id'])) {
                $tipoImovel = $this->tipoImovelModel->find($imovel['tipo_imovel_id']);
                $imovel['tipo_imovel'] = $tipoImovel ? $tipoImovel['nome'] : 'Não informado';
            } else {
                $imovel['tipo_imovel'] = 'Não informado';
            }

            // Busca bairro
            if (!empty($imovel['bairro_id'])) {
                $bairro = $this->bairroModel->find($imovel['bairro_id']);