app/Controllers/ImovelController.php

    public function index(): string|ResponseInterface
    {
        if (!$this->session->get('usuario_logado')) {
            return redirect()->to('/login');

            // return view('imovel/listar', $dados); // BUG: Código inacessível, removido.
        }

        $usuario_id = $this->session->get('usuario_id');

        $dados['imoveis'] = $this->imovelModel
            ->where('usuario_id', $usuario_id)
            ->findAll();
---
SELECT *
FROM `imoveis`
WHERE `usuario_id` = '1'