app/Controllers/SiteController.php

    public function dashboard()
    {
        // Verifica se o usuário está logado
        if (!$this->session->get('usuario_logado')) {
            return redirect()->to('/login');
        }

        // Busca os dados do usuário logado
        $usuario = $this->usuarioModel->find($this->session->get('usuario_id'));
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'

    public function meuPerfil()
    {
        // Verifica se o usuário está logado
        if (!$this->session->get('usuario_logado')) {
            return redirect()->to('/login');
        }

        // Busca os dados do usuário logado
        $usuario = $this->usuarioModel->find($this->session->get('usuario_id'));
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'