app/Views/imovel/formularioimovel.php

SELECT *
FROM `bairros`
ORDER BY `nome` ASC
---
                        <?php

                        $bairroModel = new \App\Models\BairroModel();
                        $bairros = $bairroModel->orderBy('nome', 'asc')->findAll(); // Lista ordenada